# macOS counterpart to apt/packages.txt + flatpak/packages.txt.
# Install with: brew bundle --file=brew/Brewfile

# --- Core CLI ---
brew "autoconf"
brew "automake"
brew "bison"
brew "btop"
brew "coreutils"
brew "curl"
brew "gettext"
brew "git"
brew "gnupg"
brew "jq"
brew "libevent"
brew "mise"
brew "ncurses"
brew "pkgconf"
brew "socat"
brew "starship"
brew "tree"
brew "wget"

# --- Window management (macOS) ---
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "FelixKratz/formulae/sketchybar"
brew "blueutil"  # CLI for Bluetooth state — used by sketchybar's BT indicator

# --- Apps (casks) ---
cask "brave-browser"
cask "claude"
cask "codex-app"
cask "conductor"
cask "dbeaver-community"
cask "docker"
cask "ghostty"
cask "postman"
cask "proton-mail"
cask "vivaldi"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"
cask "sf-symbols"
cask "font-sketchybar-app-font"
